In [15]:
import pandas as pd
df = pd.read_csv("Data Natixis.csv",sep = ';')
df.head()

         Date   Prix
0  02/01/2015  5,621
1  05/01/2015  5,424
2  06/01/2015  5,329
3  07/01/2015  5,224
4  08/01/2015  5,453

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1023 entries, 0 to 1022
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       1023 non-null   object
 1   Prix       1023 non-null   float64
 2   Prix_Trie  1023 non-null   object
dtypes: float64(1), object(2)
memory usage: 24.1+ KB

In [24]:
df.head()

         Date    Prix Prix_Trie
0  02/01/2015  5621.0     3,077
1  05/01/2015  5424.0     3,149
2  06/01/2015  5329.0     3,165
3  07/01/2015  5224.0      3,27
4  08/01/2015  5453.0     3,309

In [ ]:
df|'Date'] = pd.to_datetme(df['Date'])
df['Prix'] = df['Prix'].str.replace(',', '.', regex=False).astype(float)

In [30]:
df = df.drop(columns=['Prix_Trie'])
df.head()

         Date    Prix
0  02/01/2015  5621.0
1  05/01/2015  5424.0
2  06/01/2015  5329.0
3  07/01/2015  5224.0
4  08/01/2015  5453.0

In [35]:
df['Rendement'] = df['Prix'].pct_change()
df['Rendement_Abs'] = df['Rendement'].abs()

In [37]:
df['Rdm_abs_Trie'] = sorted(df['Rendement_Abs'])
df.tail()

            Date    Prix  Rendement    Rdm_Trie  Rendement_Abs  Rdm_abs_Trie
1018  21/12/2018  4045.0  -0.001481   99.285714       0.001481     99.285714
1019  24/12/2018   401.0  -0.900865  100.362319       0.900865    100.362319
1020  27/12/2018  3938.0   8.820449  103.022727       8.820449    103.022727
1021  28/12/2018  4088.0   0.038090  991.666667       0.038090    991.666667
1022  31/12/2018  4119.0   0.007583  995.333333       0.007583    995.333333

In [45]:
import numpy as np
def k(n):
    return np.log(n)

In [47]:
n=len(df)
pickand = (1 / np.log(2)) * np.log(
    (df['Rdm_abs_Trie'].iloc[n - int(k(n)) + 1] - df['Rdm_abs_Trie'].iloc[n - 2 * int(k(n)) + 1]) / 
    (df['Rdm_abs_Trie'].iloc[n - 2 * int(k(n)) + 1] - df['Rdm_abs_Trie'].iloc[n - 4 * int(k(n)) + 1])
)
print(pickand)

-6.203264551483349